tap "homebrew/bundle"
tap "homebrew/cask"
tap "olets/tap" # zsh-abbr
tap "supersonic-app/supersonic"
tap "warrensbox/tap" # tfswitch

brew "atuin"
brew "awscli"
brew "aws-elasticbeanstalk"
brew "azure-cli"
brew "bat"
brew "btop"
brew "cocoapods"
brew "coreutils"
brew "ctop"
brew "curlie"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "gnupg"
brew "graphviz" # for PlantUML
brew "hugo"
brew "jq"
brew "kubernetes-cli"
brew "libpq"
brew "mas"
brew "mise"
brew "organize-tool"
brew "pinentry-mac"
brew "pkg-config"
brew "starship"
brew "terraformer"
brew "tfswitch"
brew "tldr"
brew "zoxide"
brew "zsh"
brew "zsh-abbr"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

cask "adobe-digital-editions"
cask "affinity"
cask "bitwarden"
cask "boop"
cask "bruno"
cask "calibre"
cask "chatgpt"
cask "claude"
cask "cursor"
cask "discord"
cask "docker-desktop"
cask "firefox"
cask "ghostty"
cask "git-credential-manager"
cask "google-chrome"
cask "google-cloud-sdk"
cask "grammarly-desktop"
cask "jetbrains-toolbox"
cask "keepassxc"
cask "ledger-wallet"
cask "logitune"
cask "macpar-deluxe"
cask "makemkv"
cask "microsoft-auto-update"
cask "microsoft-office"
cask "microsoft-remote-desktop"
cask "microsoft-teams"
cask "miniwol"
cask "mp3tag"
cask "mullvad-vpn"
cask "netnewswire"
cask "notion"
cask "obsidian"
cask "postman"
cask "raspberry-pi-imager"
cask "raycast"
cask "signal"
cask "skitch"
cask "slack"
cask "sonos"
cask "spacedrive"
cask "spotify"
cask "supersonic", args: { no_quarantine: true }
cask "utm"
cask "visual-studio-code"
cask "vlc"
cask "vmware-fusion"
cask "vuescan"
cask "whatsapp"
cask "yubico-authenticator"
cask "yubico-yubikey-manager"
cask "zoom"
cask "zotero"

# Fonts
cask "font-jetbrains-mono"
cask "font-meslo-lg-nerd-font"

# App Store
mas "Disk Graph", id: 697942581
mas "Magnet", id: 441258766
mas "Microsoft To Do", id: 1274495053
mas "MQTT Explorer", id: 1455214828
mas "The Unarchiver", id: 425424353
mas "Xcode", id: 497799835