tap "datawire/blackbird" # telepresence
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "microsoft/git" # git-credential-manager-core
tap "olets/tap" # zsh-abbr
tap "romkatv/powerlevel10k"
tap "warrensbox/tap" # fswitch

brew "asdf"
brew "awscli"
brew "bat"
brew "buildifier" # Bazel build file formatter
brew "cocoapods"
brew "coreutils"
brew "fzf"
brew "git"
brew "git-delta"
brew "gnupg"
brew "graphviz" # for PlantUML
brew "jq"
brew "kubernetes-cli"
brew "libpq"
brew "mas"
brew "pinentry-mac"
brew "powerlevel10k"
brew "telepresence-arm64"
brew "tfswitch"
brew "tldr"
brew "zoxide"
brew "zsh"
brew "zsh-abbr"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

cask "adobe-digital-editions"
cask "boop"
cask "calibre"
cask "docker"
cask "firefox"
cask "git-credential-manager-core"
cask "google-chrome"
cask "iterm2"
cask "jetbrains-toolbox"
cask "keepassxc"
cask "ledger-live"
cask "macpar-deluxe"
cask "makemkv"
cask "microsoft-auto-update"
cask "microsoft-office"
cask "microsoft-remote-desktop"
cask "microsoft-teams"
cask "miniwol"
cask "mp3tag"
cask "mullvadvpn"
cask "netnewswire"
cask "obsidian"
cask "postman"
cask "raspberry-pi-imager"
cask "signal"
cask "skitch"
cask "slack"
cask "sonos"
cask "spotify"
cask "utm"
cask "visual-studio-code"
cask "vlc"
cask "vuescan"
cask "whatsapp"
cask "yubico-authenticator"
cask "zoom"

# Fonts
cask "font-jetbrains-mono"
cask "font-meslo-lg-nerd-font"

# App Store
mas "Magnet", id: 441258766
mas "Microsoft To Do", id: 1274495053
mas "The Unarchiver", id: 425424353
mas "Xcode", id: 497799835
