BazelBuild.vscode-bazel
Dart-Code.dart-code
Dart-Code.flutter
dbaeumer.vscode-eslint
eamodio.gitlens
esbenp.prettier-vscode
github.copilot
github.vscode-github-actions
golang.go
GraphQL.vscode-graphql-syntax
hashicorp.terraform
jebbs.plantuml
ms-vscode-remote.remote-containers
ms-vscode-remote.vscode-remote-extensionpack
streetsidesoftware.code-spell-checker
vscode-icons-team.vscode-icons
zxh404.vscode-proto3