anthropic.claude-code
Dart-Code.dart-code
Dart-Code.flutter
dbaeumer.vscode-eslint
esbenp.prettier-vscode
github.copilot
github.copilot-chat
github.vscode-github-actions
golang.go
GraphQL.vscode-graphql-syntax
hashicorp.terraform
jebbs.plantuml
ms-python.isort
ms-python.python
ms-vscode.live-server
ms-vscode-remote.remote-containers
ms-vscode-remote.vscode-remote-extensionpack
streetsidesoftware.code-spell-checker
tamasfe.even-better-toml
tomoki1207.pdf
vscode-icons-team.vscode-icons
zxh404.vscode-proto3